// 1. 4 н хувьсагч зарлан тоон утга өг.Өгөгдсөн 4 тооны 80-аас их тоонуудын нийлбэрийг ол.:
// a=85 b=75 c=96 d=69
// 80-аас их тоонуудын нийлбэрийг: 181



let aa = 85; 
let bb = 75; 
let cc = 96; 
let dd = 69;


if (80 > aa) {
    aa = 0;
} 
if (80 > bb) {
    bb = 0;
}  
if (80 > cc) {
    cc = 0;
}  
if (80  > dd) {
    dd = 0;
}


let sums = (aa + bb + cc + dd);
console.log(sums);


// 2. 4 н хувьсагч зарлан тоон утга өг.Өгөгдсөн 4 тооны 5-аас бага тоонуудын үржвэрийг ол. 5-аас бага тоо ядаж 1 байгаа:
// a=3 b=7 c=2 d=4
// 5-аас бага тоонуудын үржвэр: 24


let a = 3; 
let b = 7; 
let c = 2; 
let d = 4;


if (5 < a) {
 a = 1;
}
if (5 < b)
{
  b = 1;
}
if (5 < c) {
  c = 1;
}
if (5 < d) {
  d = 1;
}

let sum = (a * b * c * d);
console.log(sum);



